archive/before-2018-11-10/2018-03-26-Linux下的工具.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-03-26-Linux下的工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-03-26-Linux下的工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf122d80">1. 发包</a>
<ul>
<li><a href="#org6de3754">1.1. sendip</a></li>
<li><a href="#org2f2a0f0">1.2. Mausezahn</a></li>
<li><a href="#org397ade1">1.3. scapy</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Linux是好用，但是软件太多，同一个功能经常是有很多工具可以实现。本文记
录一些我用过觉得不错的工具的名字或者使用方法，以供后面查阅。
</p>

<div id="outline-container-orgf122d80" class="outline-2">
<h2 id="orgf122d80"><span class="section-number-2">1</span> 发包</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6de3754" class="outline-3">
<h3 id="org6de3754"><span class="section-number-3">1.1</span> sendip</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is a test tool, which make special header of tcp/ip packet.
</p>

<p>
测试工具，可以自己定制发包的ip地址，等头部信息。
</p>

<p>
通常执行格式如下：
</p>
<div class="org-src-container">
<pre class="src src-sh">     sendip &#8211;v &#8211;d r64 &#8211;p ipv4 &#8211;iv 4 &#8211;ih 5 &#8211;il 128 &#8211;is 10.0.0.1 &#8211;id 30.0.0.1 &#8211;p tcp &#8211;ts 1379 &#8211;td 23 &#8211;tt 8 30.0.0.1
     sendip &#8211;v &#8211;d r64 &#8211;p ipv4 &#8211;iv 4 &#8211;ih 5 &#8211;il 128 &#8211;is 10.0.0.1 &#8211;id 192.168.57.109 &#8211;p tcp &#8211;ts 1379 &#8211;td 8080 &#8211;tt 8 192.168.56.108
</pre>
</div>

<p>
-v：运行时输出详细运行信息，如不指定，运行时不输出信息
–d r64：用64 字节的随机数值填充IP包中的数据段
–p ipv4：指定协议类型为IP 协议（IP 协议有自己的相应参数，以i 开头）
–iv 4：协议版本为4，即IPV4
–ih 5：指定IP 头的长度为5×4＝20 字节
–il 128：指定IP 包的总长度为128 字节
–is 10.0.0.1：指定IP 包的源地址
–id 30.0.0.1：指定IP 包的目的地址
–p tcp：指定IP 包中封装的包的协议类型（TCP 协议有自己的相应参数，以t 开头）
–ts 1379：指定TCP 包的源端口1379
–td 23：指定TCP 包的目的端口为23
-tt 8：指定TCP 包的偏移量即TCP 头的长度，没有TCP 选项时为5，即20 字节，有TCP 选项时需要增加。
30.0.0.1：指定发包的目的主机
</p>

<p>
sendip –v –d r64 –p ipv4 –iv 4 –ih 5 –il 128 –is 10.0.0.1 –id 192.168.57.109 –p tcp –ts 1379 –td 8080 –tt 8 192.168.56.108
</p>
</div>
</div>

<div id="outline-container-org2f2a0f0" class="outline-3">
<h3 id="org2f2a0f0"><span class="section-number-3">1.2</span> <a href="http://www.perihel.at/sec/mz/">Mausezahn</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
发组播的数据包：
</p>
<div class="org-src-container">
<pre class="src src-sh">mz eth0 -c 0 -d 10msec -B 230.1.1.1 -t udp <span style="color: #ff4ea3;">"dp=32000,dscp=46"</span> -P <span style="color: #ff4ea3;">"Multicast test packet"</span>  
</pre>
</div>
</div>
</div>

<div id="outline-container-org397ade1" class="outline-3">
<h3 id="org397ade1"><span class="section-number-3">1.3</span> scapy</h3>
<div class="outline-text-3" id="text-1-3">
<p>
这是一个python库，我用它来发一些igmp的query包，
</p>

<p>
发送report：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/bin/python</span>

<span style="color: #a1db00;">from</span> scapy.<span style="color: #d18aff;">all</span> <span style="color: #a1db00;">import</span> *
<span style="color: #a1db00;">from</span> scapy.contrib.igmp <span style="color: #a1db00;">import</span> IGMP
<span style="color: #a1db00;">import</span> random


<span style="color: #ff8700;">src_ip</span> = <span style="color: #ff4ea3;">"192.168.1.1"</span>
<span style="color: #ff8700;">multicast_ip</span> = <span style="color: #ff4ea3;">"239.255.12.45"</span>
<span style="color: #ff8700;">interface</span> = <span style="color: #ff4ea3;">"eth0"</span>

<span style="color: #a1db00;">def</span> <span style="color: #ffd700;">send_igmp_report</span>(dst):
        <span style="color: #ff8700;">a</span>=Ether(src=<span style="color: #ff4ea3;">"94:c6:91:02:56:d6"</span>)
        <span style="color: #ff8700;">b</span>=IP(src=src_ip)
        <span style="color: #ff8700;">c</span>=IGMP(<span style="color: #d18aff;">type</span>=0x16, gaddr=dst)
        c.igmpize(b, a)
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">"Joining IP "</span> + c.gaddr + <span style="color: #ff4ea3;">" MAC "</span> + a.dst
        sendp(a/b/c, iface=interface)

send_igmp_report(multicast_ip)
   
</pre>
</div>

<p>
发送leave：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/bin/python</span>

<span style="color: #a1db00;">from</span> scapy.<span style="color: #d18aff;">all</span> <span style="color: #a1db00;">import</span> *
<span style="color: #a1db00;">from</span> scapy.contrib.igmp <span style="color: #a1db00;">import</span> IGMP
<span style="color: #a1db00;">import</span> random

<span style="color: #ff8700;">src_ip</span> = <span style="color: #ff4ea3;">"192.168.1.1"</span>
<span style="color: #ff8700;">src_mac</span> = <span style="color: #ff4ea3;">"94:c6:91:02:56:d6"</span>
<span style="color: #ff8700;">interface</span> = <span style="color: #ff4ea3;">"eth0"</span>
<span style="color: #ff8700;">multicast_ip</span> = <span style="color: #ff4ea3;">"224.239.12.45"</span>


<span style="color: #a1db00;">def</span> <span style="color: #ffd700;">send_igmp_leave</span>(dst):
        <span style="color: #ff8700;">a</span>=Ether(src=src_mac)
        <span style="color: #ff8700;">b</span>=IP(src=src_ip)
        <span style="color: #ff8700;">c</span>=IGMP(<span style="color: #d18aff;">type</span>=0x17, gaddr=dst)
        c.igmpize(b, a)
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">"Joining IP "</span> + c.gaddr + <span style="color: #ff4ea3;">" MAC "</span> + a.dst
        sendp(a/b/c, iface=interface)


send_igmp_leave(multicast_ip);
</pre>
</div>

<p>
发送普通查询：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/bin/python</span>

<span style="color: #a1db00;">from</span> scapy.<span style="color: #d18aff;">all</span> <span style="color: #a1db00;">import</span> *
<span style="color: #a1db00;">from</span> scapy.contrib.igmp <span style="color: #a1db00;">import</span> IGMP
<span style="color: #a1db00;">import</span> random


<span style="color: #ff8700;">src_ip</span> = <span style="color: #ff4ea3;">"192.168.1.1"</span>
<span style="color: #ff8700;">interface</span> = <span style="color: #ff4ea3;">"eth0"</span>
<span style="color: #ff8700;">multicast_ip</span> = <span style="color: #ff4ea3;">"224.0.0.1"</span>


<span style="color: #a1db00;">def</span> <span style="color: #ffd700;">send_igmp_ordinary_query</span>():
        <span style="color: #ff8700;">a</span>=Ether(src=<span style="color: #ff4ea3;">"94:c6:91:02:56:d6"</span>)
        <span style="color: #ff8700;">b</span>=IP(src=src_ip, dst=multicast_ip)
        <span style="color: #ff8700;">c</span>=IGMP(<span style="color: #d18aff;">type</span>=0x11)
        c.igmpize(b, a)
        sendp(a/b/c, iface=interface)

send_igmp_ordinary_query()
</pre>
</div>

<p>
发送特定组查询：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/bin/python</span>

<span style="color: #a1db00;">from</span> scapy.<span style="color: #d18aff;">all</span> <span style="color: #a1db00;">import</span> *
<span style="color: #a1db00;">from</span> scapy.contrib.igmp <span style="color: #a1db00;">import</span> IGMP
<span style="color: #a1db00;">import</span> random


<span style="color: #ff8700;">src_ip</span> = <span style="color: #ff4ea3;">"192.168.1.1"</span>
<span style="color: #ff8700;">interface</span> = <span style="color: #ff4ea3;">"eth0"</span>
<span style="color: #ff8700;">multicast_ip</span> = <span style="color: #ff4ea3;">"239.255.12.45"</span>


<span style="color: #a1db00;">def</span> <span style="color: #ffd700;">send_igmp_specified_query</span>(dst):
        <span style="color: #ff8700;">a</span>=Ether(src=<span style="color: #ff4ea3;">"94:c6:91:02:56:d6"</span>)
        <span style="color: #ff8700;">b</span>=IP(src=src_ip)
        <span style="color: #ff8700;">c</span>=IGMP(<span style="color: #d18aff;">type</span>=0x11, gaddr=dst)
        c.igmpize(b, a)
        sendp(a/b/c, iface=interface)


send_igmp_specified_query(multicast_ip)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>